import { useDispatch } from "react-redux";
import { setGenre } from "../../redux/reducers/selectedGenresSlice";
import motounData from "../../data/motoun.json";
import nourData from "../../data/nour-alyakine.json";
import fiqhData from "../../data/fiqh.json";
import year1Meetings from "../../data/years/year1/meetings-flat.json";
import year2Meetings from "../../data/years/year2/meetings-flat.json";
import year3Meetings from "../../data/years/year3/meetings-flat.json";
import year4Meetings from "../../data/years/year4/meetings-flat.json";
import year5Meetings from "../../data/years/year5/meetings-flat.json";
import dorarData from "../../data/dorarData.json";
import bjomaaData from "../../data/bjomaaData.json";
import React, { useState } from "react";
import FiqhDetailsModal from "../MovieModal/FiqhDetailsModal.jsx";
import Scene from "../../Visitors/Scene";

export default function SideBar() {
  const [openModal, setOpenModal] = useState(null);

  const dispatch = useDispatch();

  const categories = [
    {
      id: "meeting",
      title: "فوائد و عبر من اللقاءات المباشرة",
      videos: [
        ...year1Meetings.map((v) => ({ ...v, year: 1 })),
        ...year2Meetings.map((v) => ({ ...v, year: 2 })),
        ...year3Meetings.map((v) => ({ ...v, year: 3 })),
        ...year4Meetings.map((v) => ({ ...v, year: 4 })),
        ...year5Meetings.map((v) => ({ ...v, year: 5 })),
      ],
    },
    {
      id: "nour",
      title: "سلسلة في السيرة مع الدكتور منير كمنتري",
      videos: nourData,
      details: `
🎙️ يقدم الدكتور منير الكمنتر في هذه السلسلة شرحًا تفصيليًا لسيرة النبي محمد ﷺ بأسلوب علمي وديني، يركّز على الشرح التاريخي للسيرة حيث يبدأ من ظروف العالم قبل الإسلام، ثم يتناول مولد النبي ﷺ ونشأته، ويوضح مراحل الدعوة النبوية من بداية الوحي والدعوة السرية إلى الدعوة الجهرية، ويتابع الهجرة إلى المدينة، تأسيس الدولة الإسلامية، والغزوات والأحداث الكبرى في حياة النبي ﷺ. كما لا يكتفي بسرد الأحداث، بل يستخلص العِبر العملية والدروس الشرعية منها، ويربط أحداث السيرة بفقه السيرة وكيفية تطبيقها في حياة المسلم اليوم من علم وأخلاق وتعاملات اجتماعية. يعتمد الدكتور منير الكمنتر على المصادر الإسلامية الصحيحة من القرآن والسنة في تفسير الأحداث والسيرة، ويتناول صفات النبي ﷺ بشرح وتفسير يساعد المستمع على فهم الشخصية النبوية وكيفية الاقتداء بها. أسلوبه شرح مبسط وواضح مناسب لجميع المستويات من الطلاب إلى الباحثين في السيرة، ويندمج مع أحداث السيرة بالتسلسل الزمني، ما يسهل على المتلقي فهم التسلسل التاريخي والأهداف الشرعية من كل مرحلة. الهدف العام من هذه السلسلة هو فهم حياة النبي ﷺ كاملة من الولادة حتى الوفاة، واستنباط العبر الشرعية والأخلاقية التي تجعل السيرة ليست مجرد تاريخ، بل منهج حياة للمسلم.
`,
    },
    {
      id: "bjomaa",
      title: "سلسلة في العقيدة النورية مع الاستاذ محمد بن جمعة",
      videos: bjomaaData,
      details: `
ملخص عام وتعريف البرنامج: البرنامج بعنوان "العقيدة النورية"، يهدف إلى إحياء معاني التوحيد وصفاء العقيدة كما أرادها النبي محمد صلى الله عليه وسلم، بحيث تكون نقية رحيمة وواضحة. يقدم البرنامج الشيخ محمد بن جمعة عياد والشيخ هيثم الإمام، ويُبث عبر إذاعة الزيتونة للقرآن الكريم. افتتاح البرنامج بتوجيه الحمد لله والصلاة والسلام على النبي محمد، والترحيب بالمستمعين، مع الدعاء بأن يكون ما يُطرح في ميزان حسنات الجميع.

مقدمة وإطار العمل: تتضمن الحصة الأولى تعريفاً بالبرنامج وأهدافه، حيث يوضح الشيخ هيثم الإمام أن البرنامج سيرافقه فضيلة الشيخ سيدي محمد عياد. يؤكدان على أهمية البرنامج ومحاولة تثبيت المستمعين على العلم والاخلاص في التعلّم، مع التركيز على كتب علمية معتمدة وخاصة كتب أهل تونس. الكتاب الذي سيتم شرحه هو "العقيدة النورية" لمؤلفه الفقيه الولي أبو الحسن علي النور الصفاقسي التونسي، وهو من كتب العقيدة التي تُدرس في بلاد تونس.

تعريف الكتاب ومؤلفه: الشيخ علي النور الصفاقسي معروف بتعدد مؤلفاته في الفقه وعلوم القرآن، خاصة في القراءة والتجويد والترتيل، بالإضافة إلى العقيدة. البرنامج يركز على تبسيط وشرح كتاب "العقيدة النورية" ليتناسب مع المستمعين وخاصة المبتدئين. الهدف هو توصيل الفهم الصحيح للعقيدة الإسلاميّة بأسلوب واضح وميسر، والكتاب صغير الحجم لكن غني بالمضمون.

أهمية دراسة العقيدة: يجيب البرنامج على تساؤلات حول سبب اختيار شرح كتاب العقيدة النورية، وذلك لتوضيح أهمية دراسة العقيدة الإسلامية. العقيدة هي أهم وأكد العلوم الدينية، وتُعرف بعلم أصول الدين، وهي أساس صحة باقي العلوم والفروع الدينية. الحديث الشريف الذي استُند إليه هو حديث جبريل الذي يوضح ثلاثة مقاصد رئيسية: الإسلام (الفقه)، الإيمان (العقيدة)، والإحسان (السلوك والتزكية).

تقسيم العلوم الدينية: العلوم تنقسم إلى علوم وسائل (لغات، أصول الفقه…) وعلوم مقاصد (الإسلام، الإيمان، الإحسان). الكتاب يختص بعلم العقيدة (الإيمان)، وهو علم يجب على كل مكلف تعلمه بشكل عام دون الدخول في تعقيدات.

منهجية الشرح وأهميته للمستمعين: المنهجية تعتمد على تبسيط المصطلحات وشرحها بلغة قريبة من فهم المستمعين، خصوصاً الذين قد يجدون بعض المفردات غريبة أو صعبة. هذا التبسيط يعزز فهم العقيدة ويزيل الغموض عنها، ويجعل العلم في متناول الجميع. البرنامج يعتمد على منهج أهل السنة والجماعة، خاصة وفق مذهب الأشاعرة في العقيدة، وفقه مالك، وطريقة الجنيد في السلوك.

الهوية العلمية والفقهية للبرنامج: يؤكد البرنامج على أن الهوية الدينية في تونس وغيرها من بلاد المغرب العربي تعتمد على العقيدة الأشعرية، الفقه المالكي، والطريقة الجنيدية في السلوك والتزكية.

تاريخ وتواصل الهوية الدينية في تونس: العلاقة بين أهل تونس ومدينة رسول الله صلى الله عليه وسلم متواصلة لأكثر من 1400 سنة. الهوية الدينية والعلمية لتونس متجذرة عبر التاريخ.

أهمية العلم والتواصل مع المستمعين: ضرورة دراسة علم العقيدة وفهمه لأنه من العلوم الأساسية التي تضمن صحة الإيمان وسلامة الدين. أهمية توصيل العلم للناس بطريقة مبسطة وسلسة. تشجيع المستمعين على المشاركة والتدوين والمراجعة.

خطة العمل القادمة: البدء في الحصة المقبلة بشرح ماهية علم العقيدة، وتعريف كلمة العقيدة، وأسباب دراسة هذا العلم، والتأكيد على السير وفق منهج واضح ومبسط.

خاتمة الحصة الأولى: ختام الحصة بالدعاء بالتوفيق والسداد، وشكر المستمعين على المتابعة، وتجديد العزم على الاستمرار في شرح الكتاب وتبسيط العقيدة النقية، مع تحية وداع ودعاء بحفظ الله للبلاد والعباد.
`,
    },
    { id: "dorar", title: "درر مشايخنا", videos: dorarData },
    { id: "motoun", title: "المتون الشرعية", videos: motounData },
    {
      id: "fiqh",
      title: " قضايا معاصرة فقه العبادات",
      videos: fiqhData,
      details: `
وصف الكتاب : يقول الشيخ الحبيب بن طاهر هذا الكتاب في فقه العبادات على المذهب المالكي، وهو حصيلة ما ألقيته خلال الدورات التكوينية التي نظمت للسادة أئمة الخمس والمؤذنين، بجوامع ومساجد معتمديات باجة ونفزة وعمدون وتيبار، طيلة عشر سنوات، حتى يتسنّى للسادة القائمين على بيوت الله تعالى إكتساب المعلومات الدينية اللاّزمة للقيام بمهامهم على أحسن الوجوه. وقد توخيت في هذا الكتاب الدقة والتفصيل وإستيعاب المسائل، بحيث يغني في بابه عن الرجوع إلى غيره. واعتمدت بالأساس على كتاب "أقرب المسالك" بإعتباره الكتاب الذي تضمّن الأقوال المعتمدة في المذهب المالكي. وكتاب "أقرب المسالك" هو مختصر فقهي وعليه شرح، وكلاهما للشيخ أحمد الدردير، وعليه تعليق للشيخ أحمد الصاوي. وقد اعتمد الشيخ الدردير عند صياغته لمختصره على مختصر الشيخ خليل بن إسحاق، إلا أنّه استبدل الأقوال الضعيفة الواردة فيه بالأقوال المعتمدة في المذهب. وقد توليت في هذا الكتاب مزج المتن بالشرح، وصغته بأسلوب عصري يسهل على المطّلع عليه قراءته والوقوف على مسائله دون جهد.
`,
    },
  ];

  return (
    <div
      className="bg-neutral-800 text-neutral-100 p-2 pr-0 h-auto drop-shadow-lg"
      style={{
        backgroundImage:
          'url("https://st2.depositphotos.com/8843414/12482/v/450/depositphotos_124824108-stock-illustration-abstract-hexagon-molecular-structure-pattern.jpg")',
        backgroundSize: "cover",
        backgroundRepeat: "no-repeat",
        backgroundPosition: "center",
      }}
    >
      {categories.map((cat) => (
        <div key={cat.id} className="text-center mb-2">
          {/* titre principal */}
          <div
            className="flex items-center justify-center gap-3"
            style={{ direction: "rtl" }}
          >
            {/* titre principal */}
            <div
              onClick={() => dispatch(setGenre(cat))}
              className="cursor-pointer hover:bg-cyan-600 font-bold px-2"
              style={{
                fontFamily: "'Arabic Typesetting', serif",
                fontSize: "40px",
                color: "yellow",
                whiteSpace: "nowrap",
              }}
            >
              {cat.title}
            </div>

            {cat.details && (
              <span
                onClick={(e) => {
                  e.stopPropagation();
                  setOpenModal(cat);
                }}
                className="cursor-pointer inline-block"
              >
                <Scene
                  text="اضغط للمزيد"
                  as="span"
                  style={{
                    fontSize: "30px",
                    fontFamily: "'Arabic Typesetting', serif",
                    glowColor: "#00ffe7",
                  }}
                  className="underline"
                />
              </span>
            )}
          </div>
        </div>
      ))}
      {openModal && (
        <FiqhDetailsModal data={openModal} onClose={() => setOpenModal(null)} />
      )}
    </div>
  );
}
